apache/nuttx/arch/arm/src/imxrt/hardware/rt106x/imxrt106x_iomuxc.h
#define IMXRT_INPUT_ENET2_IPG_CLK_RMII           (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET2_IPG_CLK_RMII_OFFSET)
#define IMXRT_INPUT_ENET2_IPP_IND_MAC0_MDIO      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET2_IPP_IND_MAC0_MDIO_OFFSET)
#define IMXRT_INPUT_ENET2_IPP_IND_MAC0_RXDATA_0  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET2_IPP_IND_MAC0_RXDATA_0_OFFSET)
#define IMXRT_INPUT_ENET2_IPP_IND_MAC0_RXDATA_1  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET2_IPP_IND_MAC0_RXDATA_1_OFFSET)
#define IMXRT_INPUT_ENET2_IPP_IND_MAC0_RXEN      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET2_IPP_IND_MAC0_RXEN_OFFSET)
#define IMXRT_INPUT_ENET2_IPP_IND_MAC0_RXERR     (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET2_IPP_IND_MAC0_RXERR_OFFSET)
#define IMXRT_INPUT_ENET2_IPP_IND_MAC0_TIMER_0   (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET2_IPP_IND_MAC0_TIMER_0_OFFSET)
#define IMXRT_INPUT_ENET2_IPP_IND_MAC0_TXCLK     (IMXRT_IOMUXC_BASE + IMXRT_INPUT_ENET2_IPP_IND_MAC0_TXCLK_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_DQS_FA      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_DQS_FA_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FA_BIT0  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FA_BIT0_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FA_BIT1  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FA_BIT1_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FA_BIT2  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FA_BIT2_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FA_BIT3  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FA_BIT3_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FB_BIT0  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FB_BIT0_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FB_BIT1  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FB_BIT1_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FB_BIT2  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FB_BIT2_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FB_BIT3  (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_IO_FB_BIT3_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_SCK_FA      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_SCK_FA_OFFSET)
#define IMXRT_INPUT_FLEXSPI2_IPP_IND_SCK_FB      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_FLEXSPI2_IPP_IND_SCK_FB_OFFSET)
#define IMXRT_INPUT_GPT1_IPP_IND_CAPIN1          (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT1_IPP_IND_CAPIN1_OFFSET)
#define IMXRT_INPUT_GPT1_IPP_IND_CAPIN2          (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT1_IPP_IND_CAPIN2_OFFSET)
#define IMXRT_INPUT_GPT1_IPP_IND_CLKIN           (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT1_IPP_IND_CLKIN_OFFSET)
#define IMXRT_INPUT_GPT2_IPP_IND_CAPIN1          (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT2_IPP_IND_CAPIN1_OFFSET)
#define IMXRT_INPUT_GPT2_IPP_IND_CAPIN2          (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT2_IPP_IND_CAPIN2_OFFSET)
#define IMXRT_INPUT_GPT2_IPP_IND_CLKIN           (IMXRT_IOMUXC_BASE + IMXRT_INPUT_GPT2_IPP_IND_CLKIN_OFFSET)
#define IMXRT_INPUT_SAI3_IPG_CLK_SAI_MCLK_2      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI3_IPG_CLK_SAI_MCLK_2_OFFSET)
#define IMXRT_INPUT_SAI3_IPP_IND_SAI_RXBCLK      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI3_IPP_IND_SAI_RXBCLK_OFFSET)
#define IMXRT_INPUT_SAI3_IPP_IND_SAI_RXDATA_0    (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI3_IPP_IND_SAI_RXDATA_0_OFFSET)
#define IMXRT_INPUT_SAI3_IPP_IND_SAI_RXSYNC      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI3_IPP_IND_SAI_RXSYNC_OFFSET)
#define IMXRT_INPUT_SAI3_IPP_IND_SAI_TXBCLK      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI3_IPP_IND_SAI_TXBCLK_OFFSET)
#define IMXRT_INPUT_SAI3_IPP_IND_SAI_TXSYNC      (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SAI3_IPP_IND_SAI_TXSYNC_OFFSET)
#define IMXRT_INPUT_SEMC_I_IPP_IND_DQS4          (IMXRT_IOMUXC_BASE + IMXRT_INPUT_SEMC_I_IPP_IND_DQS4_OFFSET)
#define IMXRT_INPUT_CANFD_IPP_IND_CANRX          (IMXRT_IOMUXC_BASE + IMXRT_INPUT_CANFD_IPP_IND_CANRX_OFFSET)

/* Register bit definitions *********************************************************/

/* General Purpose Register 0 (GPR0) - Reserved */

/* General Purpose Register 1 (GPR1) */

#define GPR_GPR1_SAI1_MCLK1_SEL_SHIFT                           (0)
#define GPR_GPR1_SAI1_MCLK1_SEL_MASK                            (7 << GPR_GPR1_SAI1_MCLK1_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK1_SEL_CCM_SSI1_CLK_ROOT             (0 << GPR_GPR1_SAI1_MCLK1_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK1_SEL_CCM_SSI2_CLK_ROOT             (1 << GPR_GPR1_SAI1_MCLK1_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK1_SEL_CCM_SSI3_CLK_ROOT             (2 << GPR_GPR1_SAI1_MCLK1_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK1_SEL_IOMUX_SAI1_IPG_CLK_SAI_MCLK2  (3 << GPR_GPR1_SAI1_MCLK1_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK1_SEL_IOMUX_SAI2_IPG_CLK_SAI_MCLK2  (4 << GPR_GPR1_SAI1_MCLK1_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK1_SEL_IOMUX_SAI3_IPG_CLK_SAI_MCLK2  (5 << GPR_GPR1_SAI1_MCLK1_SEL_SHIFT)
#define GPR_GPR1_SAI1_MCLK2_SEL_SHIFT                           (3)
#define GPR_GPR1_SAI1_MCLK2_SEL_MASK                            (7 << GPR_GPR1_SAI1_MCLK2_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK2_SEL_CCM_SSI1_CLK_ROOT             (0 << GPR_GPR1_SAI1_MCLK2_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK2_SEL_CCM_SSI2_CLK_ROOT             (1 << GPR_GPR1_SAI1_MCLK2_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK2_SEL_CCM_SSI3_CLK_ROOT             (2 << GPR_GPR1_SAI1_MCLK2_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK2_SEL_IOMUX_SAI1_IPG_CLK_SAI_MCLK2  (3 << GPR_GPR1_SAI1_MCLK2_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK2_SEL_IOMUX_SAI2_IPG_CLK_SAI_MCLK2  (4 << GPR_GPR1_SAI1_MCLK2_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK2_SEL_IOMUX_SAI3_IPG_CLK_SAI_MCLK2  (5 << GPR_GPR1_SAI1_MCLK2_SEL_SHIFT)
#define GPR_GPR1_SAI1_MCLK3_SEL_SHIFT                           (6)
#define GPR_GPR1_SAI1_MCLK3_SEL_MASK                            (3 << GPR_GPR1_SAI1_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK3_SEL_CCM_SPDIF0_CLK_ROOT           (0 << GPR_GPR1_SAI1_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK3_SEL_IOMUX_SPDIF_TX_CLK2           (1 << GPR_GPR1_SAI1_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK3_SEL_SPDIF_SPDIF_SRCLK             (2 << GPR_GPR1_SAI1_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI1_MCLK3_SEL_SPDIF_SPDIF_OUTCLOCK          (3 << GPR_GPR1_SAI1_MCLK3_SEL_SHIFT)
#define GPR_GPR1_SAI2_MCLK3_SEL_SHIFT                           (8)
#define GPR_GPR1_SAI2_MCLK3_SEL_MASK                            (3 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI2_MCLK3_SEL_CCM_SPDIF0_CLK_ROOT           (0 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI2_MCLK3_SEL_IOMUX_SPDIF_TX_CLK2           (1 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI2_MCLK3_SEL_SPDIF_SPDIF_SRCLK             (2 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI2_MCLK3_SEL_SPDIF_SPDIF_OUTCLOCK          (3 << GPR_GPR1_SAI2_MCLK3_SEL_SHIFT)
#define GPR_GPR1_SAI3_MCLK3_SEL_SHIFT                           (10)
#define GPR_GPR1_SAI3_MCLK3_SEL_MASK                            (3 << GPR_GPR1_SAI3_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI3_MCLK3_SEL_CCM_SPDIF0_CLK_ROOT           (0 << GPR_GPR1_SAI3_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI3_MCLK3_SEL_IOMUX_SPDIF_TX_CLK2           (1 << GPR_GPR1_SAI3_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI3_MCLK3_SEL_SPDIF_SPDIF_SRCLK             (2 << GPR_GPR1_SAI3_MCLK3_SEL_SHIFT)
#  define GPR_GPR1_SAI3_MCLK3_SEL_SPDIF_SPDIF_OUTCLOCK          (3 << GPR_GPR1_SAI3_MCLK3_SEL_SHIFT)
#define GPR_GPR1_GINT                                           (1 << 12)
#define GPR_GPR1_ENET1_CLK_SEL                                  (1 << 13)
#define GPR_GPR1_ENET2_CLK_SEL                                  (1 << 14)
#define GPR_GPR1_USB_EXP_MODE_EN                                (1 << 15)
#define GPR_GPR1_ENET1_TX_CLK_OUT_EN                            (1 << 17)
#define GPR_GPR1_SAI1_MCLK_DIR_IN                               (0 << 19)
#define GPR_GPR1_SAI1_MCLK_DIR_OUT                              (1 << 19)
#define GPR_GPR1_SAI2_MCLK_DIR_IN                               (0 << 20)
#define GPR_GPR1_SAI2_MCLK_DIR_OUT                              (1 << 20)
#define GPR_GPR1_SAI3_MCLK_DIR_IN                               (0 << 21)
#define GPR_GPR1_SAI3_MCLK_DIR_OUT                              (1 << 21)
#define GPR_GPR1_EXC_MON_OKAY                                   (0 << 22)
#define GPR_GPR1_EXC_MON_SLVERR                                 (1 << 22)
#define GPR_GPR1_ENET_IMG_CLS_S_EN                              (1 << 23)
#define GPR_GPR1_CM7_FORCE_HCLK_EN                              (1 << 31)

/* General Purpose Register 2 (GPR2) */

#define GPR_GPR2_AXBS_L_AHBXL_HIGH_PRIORITY                     (1 << 0)
#define GPR_GPR2_AXBS_L_DMA_HIGH_PRIORITY                       (1 << 1)
#define GPR_GPR2_AXBS_L_FORCE_ROUND_ROBIN                       (1 << 2)
#define GPR_GPR2_AXBS_P_M0_HIGH_PRIORITY                        (1 << 3)
#define GPR_GPR2_AXBS_P_M1_HIGH_PRIORITY                        (1 << 4)
#define GPR_GPR2_AXBS_P_FORCE_ROUND_ROBIN                       (1 << 5)
#define GPR_GPR2_CANFD_FILTER_BYPASS                            (1 << 6)
#define GPR_GPR2_L2_MEM_POWERSAVE_EN                            (1 << 12)
#define GPR_GPR2_RAM_AUTO_CLK_GATING_EN                         (1 << 13)
#define GPR_GPR2_L2_MEM_FORCE_DEEPSLEEP                         (1 << 14)
#define GPR_GPR2_MQS_CLK_DIV_SHIFT                              (16)
#define GPR_GPR2_MQS_CLK_DIV_MASK                               (255 << GPR_GPR2_MQS_CLK_DIV_SHIFT)
#  define GPR_GPR2_MQS_CLK_DIV(n)                               ((n - 1) << GPR_GPR2_MQS_CLK_DIV_SHIFT)
#define GPR_GPR2_MQS_SW_RST_EN                                  (1 << 24)
#define GPR_GPR2_MQS_EN                                         (1 << 25)
#define GPR_GPR2_MQS_OVERSAMPLE32                               (0 << 26)
#define GPR_GPR2_MQS_OVERSAMPLE64                               (1 << 26)
#define GPR_GPR2_QTIM1_TMR_RESET                                (1 << 28)
#define GPR_GPR2_QTIM2_TMR_RESET                                (1 << 29)
#define GPR_GPR2_QTIM3_TMR_RESET                                (1 << 30)
#define GPR_GPR2_QTIM4_TMR_RESET                                (1 << 31)

/* General Purpose Register 3 (GPR3) */

#define GPR_GPR3_OCRAM_CTL_SHIFT                                (0)
#define GPR_GPR3_OCRAM_CTL_MASK                                 (15 << GPR_GPR3_OCRAM_CTL_SHIFT)
#  define GPR_GPR3_OCRAM_CTL_READ_DATA_PIPELINE_EN              (1 << GPR_GPR3_OCRAM_CTL_SHIFT)
#  define GPR_GPR3_OCRAM_CTL_READ_ADDR_PIPELINE_EN              (2 << GPR_GPR3_OCRAM_CTL_SHIFT)
#  define GPR_GPR3_OCRAM_CTL_WRITE_DATA_PIPELINE_EN             (4 << GPR_GPR3_OCRAM_CTL_SHIFT)
#  define GPR_GPR3_OCRAM_CTL_WRITE_ADDR_PIPELINE_EN             (8 << GPR_GPR3_OCRAM_CTL_SHIFT)
#define GPR_GPR3_DCP_KEY_SEL_128                                (0 << 4)
#define GPR_GPR3_DCP_KEY_SEL_256                                (1 << 4)
#define GPR_GPR3_OCRAM2_CTL_SHIFT                               (8)
#define GPR_GPR3_OCRAM2_CTL_MASK                                (15 << GPR_GPR3_OCRAM2_CTL_SHIFT)
#  define GPR_GPR3_OCRAM2_CTL_READ_DATA_PIPELINE_EN             (1 << GPR_GPR3_OCRAM2_CTL_SHIFT)
#  define GPR_GPR3_OCRAM2_CTL_READ_ADDR_PIPELINE_EN             (2 << GPR_GPR3_OCRAM2_CTL_SHIFT)
#  define GPR_GPR3_OCRAM2_CTL_WRITE_DATA_PIPELINE_EN            (4 << GPR_GPR3_OCRAM2_CTL_SHIFT)
#  define GPR_GPR3_OCRAM2_CTL_WRITE_ADDR_PIPELINE_EN            (8 << GPR_GPR3_OCRAM2_CTL_SHIFT)
#define GPR_GPR3_AXBS_L_HALT_REQ                                (1 << 15)
#define GPR_GPR3_OCRAM_STATUS_SHIFT                             (16)
#define GPR_GPR3_OCRAM_STATUS_MASK                              (15 << GPR_GPR3_OCRAM_STATUS_SHIFT)
#  define GPR_GPR3_OCRAM_STATUS_READ_DATA_PIPELINE_EN           (1 << GPR_GPR3_OCRAM_STATUS_SHIFT)
#  define GPR_GPR3_OCRAM_STATUS_READ_ADDR_PIPELINE_EN           (2 << GPR_GPR3_OCRAM_STATUS_SHIFT)
#  define GPR_GPR3_OCRAM_STATUS_WRITE_DATA_PIPELINE_EN          (4 << GPR_GPR3_OCRAM_STATUS_SHIFT)
#  define GPR_GPR3_OCRAM_STATUS_WRITE_ADDR_PIPELINE_EN          (8 << GPR_GPR3_OCRAM_STATUS_SHIFT)
#define GPR_GPR3_OCRAM2_STATUS_SHIFT                            (24)
#define GPR_GPR3_OCRAM2_STATUS_MASK                             (15 << GPR_GPR3_OCRAM2_STATUS_SHIFT)
#  define GPR_GPR3_OCRAM2_STATUS_READ_DATA_PIPELINE_EN          (1 << GPR_GPR3_OCRAM2_STATUS_SHIFT)
#  define GPR_GPR3_OCRAM2_STATUS_READ_ADDR_PIPELINE_EN          (2 << GPR_GPR3_OCRAM2_STATUS_SHIFT)
#  define GPR_GPR3_OCRAM2_STATUS_WRITE_DATA_PIPELINE_EN         (4 << GPR_GPR3_OCRAM2_STATUS_SHIFT)
#  define GPR_GPR3_OCRAM2_STATUS_WRITE_ADDR_PIPELINE_EN         (8 << GPR_GPR3_OCRAM2_STATUS_SHIFT)
#define GPR_GPR3_AXBS_L_HALTED                                  (1 << 31)

/* General Purpose Register 4 (GPR4) */

#define GPR_GRP4_EDMA_STOP_REQ                                  (1 << 0)
#define GPR_GPR4_CAN1_STOP_REQ                                  (1 << 1)
#define GPR_GPR4_CAN2_STOP_REQ                                  (1 << 2)
#define GPR_GPR4_TRNG_STOP_REQ                                  (1 << 3)
#define GPR_GPR4_ENET_STOP_REQ                                  (1 << 4)
#define GPR_GPR4_SAI1_STOP_REQ                                  (1 << 5)
#define GPR_GPR4_SAI2_STOP_REQ                                  (1 << 6)
#define GPR_GPR4_SAI3_STOP_REQ                                  (1 << 7)
#define GPR_GPR4_ENET2_STOP_REQ                                 (1 << 8)
#define GPR_GPR4_SEMC_STOP_REQ                                  (1 << 9)
#define GPR_GPR4_PIT_STOP_REQ                                   (1 << 10)
#define GPR_GPR4_FLEXSPI_STOP_REQ                               (1 << 11)
#define GPR_GPR4_FLEXIO1_STOP_REQ                               (1 << 12)
#define GPR_GPR4_FLEXIO2_STOP_REQ                               (1 << 13)
#define GPR_GPR4_FLEXIO3_STOP_REQ                               (1 << 14)
#define GPR_GPR4_FLEXSPI2_STOP_REQ                              (1 << 15)
#define GPR_GRP4_EDMA_STOP_ACK                                  (1 << 16)
#define GPR_GPR4_CAN1_STOP_ACK                                  (1 << 17)
#define GPR_GPR4_CAN2_STOP_ACK                                  (1 << 18)
#define GPR_GPR4_TRNG_STOP_ACK                                  (1 << 19)
#define GPR_GPR4_ENET_STOP_ACK                                  (1 << 20)
#define GPR_GPR4_SAI1_STOP_ACK                                  (1 << 21)
#define GPR_GPR4_SAI2_STOP_ACK                                  (1 << 22)
#define GPR_GPR4_SAI3_STOP_ACK                                  (1 << 23)
#define GPR_GPR4_ENET2_STOP_ACK                                 (1 << 24)
#define GPR_GPR4_SEMC_STOP_ACK                                  (1 << 25)
#define GPR_GPR4_PIT_STOP_ACK                                   (1 << 26)
#define GPR_GPR4_FLEXSPI_STOP_ACK                               (1 << 27)
#define GPR_GPR4_FLEXIO1_STOP_ACK                               (1 << 28)
#define GPR_GPR4_FLEXIO2_STOP_ACK                               (1 << 29)
#define GPR_GPR4_FLEXIO3_STOP_ACK                               (1 << 30)
#define GPR_GPR4_FLEXSPI2_STOP_ACK                              (1 << 31)

/* General Purpose Register 5 (GPR5) */

