apache/nuttx/arch/arm/src/imxrt/hardware/rt106x/imxrt106x_iomuxc.h
/* General Purpose Register 19 (GPR19) */

#define GPR_GPR19_LOCK_M7_APC_AC_R0_TOP                         (1 << 0)
#define GPR_GPR19_M7_APC_AC_R0_TOP_SHIFT                        (3)
#define GPR_GPR19_M7_APC_AC_R0_TOP_MASK                         (0x1fffffff << GPR_GPR19_M7_APC_AC_R0_TOP_SHIFT)
#define GPR_GPR19_M7_APC_AC_R0_TOP(n)                           ((uint32_t)(n)) << GPR_GPR19_M7_APC_AC_R0_TOP_SHIFT)

/* General Purpose Register 20 (GPR20) */

#define GPR_GPR20_LOCK_M7_APC_AC_R1_BOT                         (1 << 0)
#define GPR_GPR20_M7_APC_AC_R1_BOT_SHIFT                        (3)
#define GPR_GPR20_M7_APC_AC_R1_BOT_MASK                         (0x1fffffff << GPR_GPR18_M7_APC_AC_R1_BOT_SHIFT)
#define GPR_GPR20_M7_APC_AC_R1_BOT(n)                           ((uint32_t)(n)) << GPR_GPR20_M7_APC_AC_R1_BOT_SHIFT)

/* General Purpose Register 21 (GPR21) */

#define GPR_GPR21_LOCK_M7_APC_AC_R1_TOP                         (1 << 0)
#define GPR_GPR21_M7_APC_AC_R1_TOP_SHIFT                        (3)
#define GPR_GPR21_M7_APC_AC_R1_TOP_MASK                         (0x1fffffff << GPR_GPR21_M7_APC_AC_R1_TOP_SHIFT)
#define GPR_GPR21_M7_APC_AC_R1_TOP(n)                           ((uint32_t)(n)) << GPR_GPR21_M7_APC_AC_R1_TOP_SHIFT)

/* General Purpose Register 22 (GPR22) */

#define GPR_GPR22_LOCK_M7_APC_AC_R2_BOT                         (1 << 0)
#define GPR_GPR22_M7_APC_AC_R2_BOT_SHIFT                        (3)
#define GPR_GPR22_M7_APC_AC_R2_BOT_MASK                         (0x1fffffff << GPR_GPR18_M7_APC_AC_R2_BOT_SHIFT)
#define GPR_GPR22_M7_APC_AC_R2_BOT(n)                           ((uint32_t)(n)) << GPR_GPR22_M7_APC_AC_R2_BOT_SHIFT)

/* General Purpose Register 23 (GPR23) */

#define GPR_GPR23_LOCK_M7_APC_AC_R2_TOP                         (1 << 0)
#define GPR_GPR23_M7_APC_AC_R2_TOP_SHIFT                        (3)
#define GPR_GPR23_M7_APC_AC_R2_TOP_MASK                         (0x1fffffff << GPR_GPR23_M7_APC_AC_R2_TOP_SHIFT)
#define GPR_GPR23_M7_APC_AC_R2_TOP(n)                           ((uint32_t)(n)) << GPR_GPR23_M7_APC_AC_R2_TOP_SHIFT)

/* General Purpose Register 24 (GPR24) */

#define GPR_GPR24_LOCK_M7_APC_AC_R3_BOT                         (1 << 0)
#define GPR_GPR24_M7_APC_AC_R3_BOT_SHIFT                        (3)
#define GPR_GPR24_M7_APC_AC_R3_BOT_MASK                         (0x1fffffff << GPR_GPR18_M7_APC_AC_R3_BOT_SHIFT)
#define GPR_GPR24_M7_APC_AC_R3_BOT(n)                           ((uint32_t)(n)) << GPR_GPR24_M7_APC_AC_R3_BOT_SHIFT)

/* General Purpose Register 25 (GPR25) */

#define GPR_GPR25_LOCK_M7_APC_AC_R3_TOP                         (1 << 0)
#define GPR_GPR25_M7_APC_AC_R3_TOP_SHIFT                        (3)
#define GPR_GPR25_M7_APC_AC_R3_TOP_MASK                         (0x1fffffff << GPR_GPR25_M7_APC_AC_R3_TOP_SHIFT)
#define GPR_GPR25_M7_APC_AC_R3_TOP(n)                           ((uint32_t)(n)) << GPR_GPR25_M7_APC_AC_R3_TOP_SHIFT)

/* General Purpose Register 26 (GPR26) */

#define GPR_GPR26_GPIO_MUX1_GPIO0_SEL_GPIO1                     (0 << 0)
#define GPR_GPR26_GPIO_MUX1_GPIO0_SEL_GPIO6                     (1 << 0)
#define GPR_GPR26_GPIO_MUX1_GPIO1_SEL_GPIO1                     (0 << 1)
#define GPR_GPR26_GPIO_MUX1_GPIO1_SEL_GPIO6                     (1 << 1)
#define GPR_GPR26_GPIO_MUX1_GPIO2_SEL_GPIO1                     (0 << 2)
#define GPR_GPR26_GPIO_MUX1_GPIO2_SEL_GPIO6                     (1 << 2)
#define GPR_GPR26_GPIO_MUX1_GPIO3_SEL_GPIO1                     (0 << 3)
#define GPR_GPR26_GPIO_MUX1_GPIO3_SEL_GPIO6                     (1 << 3)
#define GPR_GPR26_GPIO_MUX1_GPIO4_SEL_GPIO1                     (0 << 4)
#define GPR_GPR26_GPIO_MUX1_GPIO4_SEL_GPIO6                     (1 << 4)
#define GPR_GPR26_GPIO_MUX1_GPIO5_SEL_GPIO1                     (0 << 5)
#define GPR_GPR26_GPIO_MUX1_GPIO5_SEL_GPIO6                     (1 << 5)
#define GPR_GPR26_GPIO_MUX1_GPIO6_SEL_GPIO1                     (0 << 6)
#define GPR_GPR26_GPIO_MUX1_GPIO6_SEL_GPIO6                     (1 << 6)
#define GPR_GPR26_GPIO_MUX1_GPIO7_SEL_GPIO1                     (0 << 7)
#define GPR_GPR26_GPIO_MUX1_GPIO7_SEL_GPIO6                     (1 << 7)
#define GPR_GPR26_GPIO_MUX1_GPIO8_SEL_GPIO1                     (0 << 8)
#define GPR_GPR26_GPIO_MUX1_GPIO8_SEL_GPIO6                     (1 << 8)
#define GPR_GPR26_GPIO_MUX1_GPIO9_SEL_GPIO1                     (0 << 9)
#define GPR_GPR26_GPIO_MUX1_GPIO9_SEL_GPIO6                     (1 << 9)
#define GPR_GPR26_GPIO_MUX1_GPIO10_SEL_GPIO1                    (0 << 10)
#define GPR_GPR26_GPIO_MUX1_GPIO10_SEL_GPIO6                    (1 << 10)
#define GPR_GPR26_GPIO_MUX1_GPIO11_SEL_GPIO1                    (0 << 11)
#define GPR_GPR26_GPIO_MUX1_GPIO11_SEL_GPIO6                    (1 << 11)
#define GPR_GPR26_GPIO_MUX1_GPIO12_SEL_GPIO1                    (0 << 12)
#define GPR_GPR26_GPIO_MUX1_GPIO12_SEL_GPIO6                    (1 << 12)
#define GPR_GPR26_GPIO_MUX1_GPIO13_SEL_GPIO1                    (0 << 13)
#define GPR_GPR26_GPIO_MUX1_GPIO13_SEL_GPIO6                    (1 << 13)
#define GPR_GPR26_GPIO_MUX1_GPIO14_SEL_GPIO1                    (0 << 14)
#define GPR_GPR26_GPIO_MUX1_GPIO14_SEL_GPIO6                    (1 << 14)
#define GPR_GPR26_GPIO_MUX1_GPIO15_SEL_GPIO1                    (0 << 15)
#define GPR_GPR26_GPIO_MUX1_GPIO15_SEL_GPIO6                    (1 << 15)
#define GPR_GPR26_GPIO_MUX1_GPIO16_SEL_GPIO1                    (0 << 16)
#define GPR_GPR26_GPIO_MUX1_GPIO16_SEL_GPIO6                    (1 << 16)
#define GPR_GPR26_GPIO_MUX1_GPIO17_SEL_GPIO1                    (0 << 17)
#define GPR_GPR26_GPIO_MUX1_GPIO17_SEL_GPIO6                    (1 << 17)
#define GPR_GPR26_GPIO_MUX1_GPIO18_SEL_GPIO1                    (0 << 18)
#define GPR_GPR26_GPIO_MUX1_GPIO18_SEL_GPIO6                    (1 << 18)
#define GPR_GPR26_GPIO_MUX1_GPIO19_SEL_GPIO1                    (0 << 19)
#define GPR_GPR26_GPIO_MUX1_GPIO19_SEL_GPIO6                    (1 << 19)
#define GPR_GPR26_GPIO_MUX1_GPIO20_SEL_GPIO1                    (0 << 20)
#define GPR_GPR26_GPIO_MUX1_GPIO20_SEL_GPIO6                    (1 << 20)
#define GPR_GPR26_GPIO_MUX1_GPIO21_SEL_GPIO1                    (0 << 21)
#define GPR_GPR26_GPIO_MUX1_GPIO21_SEL_GPIO6                    (1 << 21)
#define GPR_GPR26_GPIO_MUX1_GPIO22_SEL_GPIO1                    (0 << 22)
#define GPR_GPR26_GPIO_MUX1_GPIO22_SEL_GPIO6                    (1 << 22)
#define GPR_GPR26_GPIO_MUX1_GPIO23_SEL_GPIO1                    (0 << 23)
#define GPR_GPR26_GPIO_MUX1_GPIO23_SEL_GPIO6                    (1 << 23)
#define GPR_GPR26_GPIO_MUX1_GPIO24_SEL_GPIO1                    (0 << 24)
#define GPR_GPR26_GPIO_MUX1_GPIO24_SEL_GPIO6                    (1 << 24)
#define GPR_GPR26_GPIO_MUX1_GPIO25_SEL_GPIO1                    (0 << 25)
#define GPR_GPR26_GPIO_MUX1_GPIO25_SEL_GPIO6                    (1 << 25)
#define GPR_GPR26_GPIO_MUX1_GPIO26_SEL_GPIO1                    (0 << 26)
#define GPR_GPR26_GPIO_MUX1_GPIO26_SEL_GPIO6                    (1 << 26)
#define GPR_GPR26_GPIO_MUX1_GPIO27_SEL_GPIO1                    (0 << 27)
#define GPR_GPR26_GPIO_MUX1_GPIO27_SEL_GPIO6                    (1 << 27)
#define GPR_GPR26_GPIO_MUX1_GPIO28_SEL_GPIO1                    (0 << 28)
#define GPR_GPR26_GPIO_MUX1_GPIO28_SEL_GPIO6                    (1 << 28)
#define GPR_GPR26_GPIO_MUX1_GPIO29_SEL_GPIO1                    (0 << 29)
#define GPR_GPR26_GPIO_MUX1_GPIO29_SEL_GPIO6                    (1 << 29)
#define GPR_GPR26_GPIO_MUX1_GPIO30_SEL_GPIO1                    (0 << 30)
#define GPR_GPR26_GPIO_MUX1_GPIO30_SEL_GPIO6                    (1 << 30)
#define GPR_GPR26_GPIO_MUX1_GPIO31_SEL_GPIO1                    (0 << 31)
#define GPR_GPR26_GPIO_MUX1_GPIO31_SEL_GPIO6                    (1 << 31)

/* General Purpose Register 27 (GPR27) */

