apache/nuttx/arch/arm/src/imxrt/hardware/rt106x/imxrt106x_iomuxc.h
#define GPR_GPR27_GPIO_MUX2_GPIO0_SEL_GPIO2                     (0 << 0)
#define GPR_GPR27_GPIO_MUX2_GPIO0_SEL_GPIO7                     (1 << 0)
#define GPR_GPR27_GPIO_MUX2_GPIO1_SEL_GPIO2                     (0 << 1)
#define GPR_GPR27_GPIO_MUX2_GPIO1_SEL_GPIO7                     (1 << 1)
#define GPR_GPR27_GPIO_MUX2_GPIO2_SEL_GPIO2                     (0 << 2)
#define GPR_GPR27_GPIO_MUX2_GPIO2_SEL_GPIO7                     (1 << 2)
#define GPR_GPR27_GPIO_MUX2_GPIO3_SEL_GPIO2                     (0 << 3)
#define GPR_GPR27_GPIO_MUX2_GPIO3_SEL_GPIO7                     (1 << 3)
#define GPR_GPR27_GPIO_MUX2_GPIO4_SEL_GPIO2                     (0 << 4)
#define GPR_GPR27_GPIO_MUX2_GPIO4_SEL_GPIO7                     (1 << 4)
#define GPR_GPR27_GPIO_MUX2_GPIO5_SEL_GPIO2                     (0 << 5)
#define GPR_GPR27_GPIO_MUX2_GPIO5_SEL_GPIO7                     (1 << 5)
#define GPR_GPR27_GPIO_MUX2_GPIO6_SEL_GPIO2                     (0 << 6)
#define GPR_GPR27_GPIO_MUX2_GPIO6_SEL_GPIO7                     (1 << 6)
#define GPR_GPR27_GPIO_MUX2_GPIO7_SEL_GPIO2                     (0 << 7)
#define GPR_GPR27_GPIO_MUX2_GPIO7_SEL_GPIO7                     (1 << 7)
#define GPR_GPR27_GPIO_MUX2_GPIO8_SEL_GPIO2                     (0 << 8)
#define GPR_GPR27_GPIO_MUX2_GPIO8_SEL_GPIO7                     (1 << 8)
#define GPR_GPR27_GPIO_MUX2_GPIO9_SEL_GPIO2                     (0 << 9)
#define GPR_GPR27_GPIO_MUX2_GPIO9_SEL_GPIO7                     (1 << 9)
#define GPR_GPR27_GPIO_MUX2_GPIO10_SEL_GPIO2                    (0 << 10)
#define GPR_GPR27_GPIO_MUX2_GPIO10_SEL_GPIO7                    (1 << 10)
#define GPR_GPR27_GPIO_MUX2_GPIO11_SEL_GPIO2                    (0 << 11)
#define GPR_GPR27_GPIO_MUX2_GPIO11_SEL_GPIO7                    (1 << 11)
#define GPR_GPR27_GPIO_MUX2_GPIO12_SEL_GPIO2                    (0 << 12)
#define GPR_GPR27_GPIO_MUX2_GPIO12_SEL_GPIO7                    (1 << 12)
#define GPR_GPR27_GPIO_MUX2_GPIO13_SEL_GPIO2                    (0 << 13)
#define GPR_GPR27_GPIO_MUX2_GPIO13_SEL_GPIO7                    (1 << 13)
#define GPR_GPR27_GPIO_MUX2_GPIO14_SEL_GPIO2                    (0 << 14)
#define GPR_GPR27_GPIO_MUX2_GPIO14_SEL_GPIO7                    (1 << 14)
#define GPR_GPR27_GPIO_MUX2_GPIO15_SEL_GPIO2                    (0 << 15)
#define GPR_GPR27_GPIO_MUX2_GPIO15_SEL_GPIO7                    (1 << 15)
#define GPR_GPR27_GPIO_MUX2_GPIO16_SEL_GPIO2                    (0 << 16)
#define GPR_GPR27_GPIO_MUX2_GPIO16_SEL_GPIO7                    (1 << 16)
#define GPR_GPR27_GPIO_MUX2_GPIO17_SEL_GPIO2                    (0 << 17)
#define GPR_GPR27_GPIO_MUX2_GPIO17_SEL_GPIO7                    (1 << 17)
#define GPR_GPR27_GPIO_MUX2_GPIO18_SEL_GPIO2                    (0 << 18)
#define GPR_GPR27_GPIO_MUX2_GPIO18_SEL_GPIO7                    (1 << 18)
#define GPR_GPR27_GPIO_MUX2_GPIO19_SEL_GPIO2                    (0 << 19)
#define GPR_GPR27_GPIO_MUX2_GPIO19_SEL_GPIO7                    (1 << 19)
#define GPR_GPR27_GPIO_MUX2_GPIO20_SEL_GPIO2                    (0 << 20)
#define GPR_GPR27_GPIO_MUX2_GPIO20_SEL_GPIO7                    (1 << 20)
#define GPR_GPR27_GPIO_MUX2_GPIO21_SEL_GPIO2                    (0 << 21)
#define GPR_GPR27_GPIO_MUX2_GPIO21_SEL_GPIO7                    (1 << 21)
#define GPR_GPR27_GPIO_MUX2_GPIO22_SEL_GPIO2                    (0 << 22)
#define GPR_GPR27_GPIO_MUX2_GPIO22_SEL_GPIO7                    (1 << 22)
#define GPR_GPR27_GPIO_MUX2_GPIO23_SEL_GPIO2                    (0 << 23)
#define GPR_GPR27_GPIO_MUX2_GPIO23_SEL_GPIO7                    (1 << 23)
#define GPR_GPR27_GPIO_MUX2_GPIO24_SEL_GPIO2                    (0 << 24)
#define GPR_GPR27_GPIO_MUX2_GPIO24_SEL_GPIO7                    (1 << 24)
#define GPR_GPR27_GPIO_MUX2_GPIO25_SEL_GPIO2                    (0 << 25)
#define GPR_GPR27_GPIO_MUX2_GPIO25_SEL_GPIO7                    (1 << 25)
#define GPR_GPR27_GPIO_MUX2_GPIO26_SEL_GPIO2                    (0 << 26)
#define GPR_GPR27_GPIO_MUX2_GPIO26_SEL_GPIO7                    (1 << 26)
#define GPR_GPR27_GPIO_MUX2_GPIO27_SEL_GPIO2                    (0 << 27)
#define GPR_GPR27_GPIO_MUX2_GPIO27_SEL_GPIO7                    (1 << 27)
#define GPR_GPR27_GPIO_MUX2_GPIO28_SEL_GPIO2                    (0 << 28)
#define GPR_GPR27_GPIO_MUX2_GPIO28_SEL_GPIO7                    (1 << 28)
#define GPR_GPR27_GPIO_MUX2_GPIO29_SEL_GPIO2                    (0 << 29)
#define GPR_GPR27_GPIO_MUX2_GPIO29_SEL_GPIO7                    (1 << 29)
#define GPR_GPR27_GPIO_MUX2_GPIO30_SEL_GPIO2                    (0 << 30)
#define GPR_GPR27_GPIO_MUX2_GPIO30_SEL_GPIO7                    (1 << 30)
#define GPR_GPR27_GPIO_MUX2_GPIO31_SEL_GPIO2                    (0 << 31)
#define GPR_GPR27_GPIO_MUX2_GPIO31_SEL_GPIO7                    (1 << 31)

/* General Purpose Register 28 (GPR28) */

#define GPR_GPR28_GPIO_MUX3_GPIO0_SEL_GPIO3                     (0 << 0)
#define GPR_GPR28_GPIO_MUX3_GPIO0_SEL_GPIO8                     (1 << 0)
#define GPR_GPR28_GPIO_MUX3_GPIO1_SEL_GPIO3                     (0 << 1)
#define GPR_GPR28_GPIO_MUX3_GPIO1_SEL_GPIO8                     (1 << 1)
#define GPR_GPR28_GPIO_MUX3_GPIO2_SEL_GPIO3                     (0 << 2)
#define GPR_GPR28_GPIO_MUX3_GPIO2_SEL_GPIO8                     (1 << 2)
#define GPR_GPR28_GPIO_MUX3_GPIO3_SEL_GPIO3                     (0 << 3)
#define GPR_GPR28_GPIO_MUX3_GPIO3_SEL_GPIO8                     (1 << 3)
#define GPR_GPR28_GPIO_MUX3_GPIO4_SEL_GPIO3                     (0 << 4)
#define GPR_GPR28_GPIO_MUX3_GPIO4_SEL_GPIO8                     (1 << 4)
#define GPR_GPR28_GPIO_MUX3_GPIO5_SEL_GPIO3                     (0 << 5)
#define GPR_GPR28_GPIO_MUX3_GPIO5_SEL_GPIO8                     (1 << 5)
#define GPR_GPR28_GPIO_MUX3_GPIO6_SEL_GPIO3                     (0 << 6)
#define GPR_GPR28_GPIO_MUX3_GPIO6_SEL_GPIO8                     (1 << 6)
#define GPR_GPR28_GPIO_MUX3_GPIO7_SEL_GPIO3                     (0 << 7)
#define GPR_GPR28_GPIO_MUX3_GPIO7_SEL_GPIO8                     (1 << 7)
#define GPR_GPR28_GPIO_MUX3_GPIO8_SEL_GPIO3                     (0 << 8)
#define GPR_GPR28_GPIO_MUX3_GPIO8_SEL_GPIO8                     (1 << 8)
#define GPR_GPR28_GPIO_MUX3_GPIO9_SEL_GPIO3                     (0 << 9)
#define GPR_GPR28_GPIO_MUX3_GPIO9_SEL_GPIO8                     (1 << 9)
#define GPR_GPR28_GPIO_MUX3_GPIO10_SEL_GPIO3                    (0 << 10)
#define GPR_GPR28_GPIO_MUX3_GPIO10_SEL_GPIO8                    (1 << 10)
#define GPR_GPR28_GPIO_MUX3_GPIO11_SEL_GPIO3                    (0 << 11)
#define GPR_GPR28_GPIO_MUX3_GPIO11_SEL_GPIO8                    (1 << 11)
#define GPR_GPR28_GPIO_MUX3_GPIO12_SEL_GPIO3                    (0 << 12)
#define GPR_GPR28_GPIO_MUX3_GPIO12_SEL_GPIO8                    (1 << 12)
#define GPR_GPR28_GPIO_MUX3_GPIO13_SEL_GPIO3                    (0 << 13)
#define GPR_GPR28_GPIO_MUX3_GPIO13_SEL_GPIO8                    (1 << 13)
#define GPR_GPR28_GPIO_MUX3_GPIO14_SEL_GPIO3                    (0 << 14)
#define GPR_GPR28_GPIO_MUX3_GPIO14_SEL_GPIO8                    (1 << 14)
#define GPR_GPR28_GPIO_MUX3_GPIO15_SEL_GPIO3                    (0 << 15)
#define GPR_GPR28_GPIO_MUX3_GPIO15_SEL_GPIO8                    (1 << 15)
#define GPR_GPR28_GPIO_MUX3_GPIO16_SEL_GPIO3                    (0 << 16)
#define GPR_GPR28_GPIO_MUX3_GPIO16_SEL_GPIO8                    (1 << 16)
#define GPR_GPR28_GPIO_MUX3_GPIO17_SEL_GPIO3                    (0 << 17)
#define GPR_GPR28_GPIO_MUX3_GPIO17_SEL_GPIO8                    (1 << 17)
#define GPR_GPR28_GPIO_MUX3_GPIO18_SEL_GPIO3                    (0 << 18)
#define GPR_GPR28_GPIO_MUX3_GPIO18_SEL_GPIO8                    (1 << 18)
#define GPR_GPR28_GPIO_MUX3_GPIO19_SEL_GPIO3                    (0 << 19)
#define GPR_GPR28_GPIO_MUX3_GPIO19_SEL_GPIO8                    (1 << 19)
#define GPR_GPR28_GPIO_MUX3_GPIO20_SEL_GPIO3                    (0 << 20)
#define GPR_GPR28_GPIO_MUX3_GPIO20_SEL_GPIO8                    (1 << 20)
#define GPR_GPR28_GPIO_MUX3_GPIO21_SEL_GPIO3                    (0 << 21)
#define GPR_GPR28_GPIO_MUX3_GPIO21_SEL_GPIO8                    (1 << 21)
#define GPR_GPR28_GPIO_MUX3_GPIO22_SEL_GPIO3                    (0 << 22)
#define GPR_GPR28_GPIO_MUX3_GPIO22_SEL_GPIO8                    (1 << 22)
#define GPR_GPR28_GPIO_MUX3_GPIO23_SEL_GPIO3                    (0 << 23)
#define GPR_GPR28_GPIO_MUX3_GPIO23_SEL_GPIO8                    (1 << 23)
#define GPR_GPR28_GPIO_MUX3_GPIO24_SEL_GPIO3                    (0 << 24)
#define GPR_GPR28_GPIO_MUX3_GPIO24_SEL_GPIO8                    (1 << 24)
#define GPR_GPR28_GPIO_MUX3_GPIO25_SEL_GPIO3                    (0 << 25)
#define GPR_GPR28_GPIO_MUX3_GPIO25_SEL_GPIO8                    (1 << 25)
#define GPR_GPR28_GPIO_MUX3_GPIO26_SEL_GPIO3                    (0 << 26)
#define GPR_GPR28_GPIO_MUX3_GPIO26_SEL_GPIO8                    (1 << 26)
#define GPR_GPR28_GPIO_MUX3_GPIO27_SEL_GPIO3                    (0 << 27)
#define GPR_GPR28_GPIO_MUX3_GPIO27_SEL_GPIO8                    (1 << 27)
#define GPR_GPR28_GPIO_MUX3_GPIO28_SEL_GPIO3                    (0 << 28)
#define GPR_GPR28_GPIO_MUX3_GPIO28_SEL_GPIO8                    (1 << 28)
#define GPR_GPR28_GPIO_MUX3_GPIO29_SEL_GPIO3                    (0 << 29)
#define GPR_GPR28_GPIO_MUX3_GPIO29_SEL_GPIO8                    (1 << 29)
#define GPR_GPR28_GPIO_MUX3_GPIO30_SEL_GPIO3                    (0 << 30)
#define GPR_GPR28_GPIO_MUX3_GPIO30_SEL_GPIO8                    (1 << 30)
#define GPR_GPR28_GPIO_MUX3_GPIO31_SEL_GPIO3                    (0 << 31)
#define GPR_GPR28_GPIO_MUX3_GPIO31_SEL_GPIO8                    (1 << 31)

