apache/nuttx/arch/arm/src/imxrt/hardware/rt106x/imxrt106x_iomuxc.h
/* General Purpose Register 29 (GPR29) */

#define GPR_GPR29_GPIO_MUX4_GPIO0_SEL_GPIO4                     (0 << 0)
#define GPR_GPR29_GPIO_MUX4_GPIO0_SEL_GPIO9                     (1 << 0)
#define GPR_GPR29_GPIO_MUX4_GPIO1_SEL_GPIO4                     (0 << 1)
#define GPR_GPR29_GPIO_MUX4_GPIO1_SEL_GPIO9                     (1 << 1)
#define GPR_GPR29_GPIO_MUX4_GPIO2_SEL_GPIO4                     (0 << 2)
#define GPR_GPR29_GPIO_MUX4_GPIO2_SEL_GPIO9                     (1 << 2)
#define GPR_GPR29_GPIO_MUX4_GPIO3_SEL_GPIO4                     (0 << 3)
#define GPR_GPR29_GPIO_MUX4_GPIO3_SEL_GPIO9                     (1 << 3)
#define GPR_GPR29_GPIO_MUX4_GPIO4_SEL_GPIO4                     (0 << 4)
#define GPR_GPR29_GPIO_MUX4_GPIO4_SEL_GPIO9                     (1 << 4)
#define GPR_GPR29_GPIO_MUX4_GPIO5_SEL_GPIO4                     (0 << 5)
#define GPR_GPR29_GPIO_MUX4_GPIO5_SEL_GPIO9                     (1 << 5)
#define GPR_GPR29_GPIO_MUX4_GPIO6_SEL_GPIO4                     (0 << 6)
#define GPR_GPR29_GPIO_MUX4_GPIO6_SEL_GPIO9                     (1 << 6)
#define GPR_GPR29_GPIO_MUX4_GPIO7_SEL_GPIO4                     (0 << 7)
#define GPR_GPR29_GPIO_MUX4_GPIO7_SEL_GPIO9                     (1 << 7)
#define GPR_GPR29_GPIO_MUX4_GPIO8_SEL_GPIO4                     (0 << 8)
#define GPR_GPR29_GPIO_MUX4_GPIO8_SEL_GPIO9                     (1 << 8)
#define GPR_GPR29_GPIO_MUX4_GPIO9_SEL_GPIO4                     (0 << 9)
#define GPR_GPR29_GPIO_MUX4_GPIO9_SEL_GPIO9                     (1 << 9)
#define GPR_GPR29_GPIO_MUX4_GPIO10_SEL_GPIO4                    (0 << 10)
#define GPR_GPR29_GPIO_MUX4_GPIO10_SEL_GPIO9                    (1 << 10)
#define GPR_GPR29_GPIO_MUX4_GPIO11_SEL_GPIO4                    (0 << 11)
#define GPR_GPR29_GPIO_MUX4_GPIO11_SEL_GPIO9                    (1 << 11)
#define GPR_GPR29_GPIO_MUX4_GPIO12_SEL_GPIO4                    (0 << 12)
#define GPR_GPR29_GPIO_MUX4_GPIO12_SEL_GPIO9                    (1 << 12)
#define GPR_GPR29_GPIO_MUX4_GPIO13_SEL_GPIO4                    (0 << 13)
#define GPR_GPR29_GPIO_MUX4_GPIO13_SEL_GPIO9                    (1 << 13)
#define GPR_GPR29_GPIO_MUX4_GPIO14_SEL_GPIO4                    (0 << 14)
#define GPR_GPR29_GPIO_MUX4_GPIO14_SEL_GPIO9                    (1 << 14)
#define GPR_GPR29_GPIO_MUX4_GPIO15_SEL_GPIO4                    (0 << 15)
#define GPR_GPR29_GPIO_MUX4_GPIO15_SEL_GPIO9                    (1 << 15)
#define GPR_GPR29_GPIO_MUX4_GPIO16_SEL_GPIO4                    (0 << 16)
#define GPR_GPR29_GPIO_MUX4_GPIO16_SEL_GPIO9                    (1 << 16)
#define GPR_GPR29_GPIO_MUX4_GPIO17_SEL_GPIO4                    (0 << 17)
#define GPR_GPR29_GPIO_MUX4_GPIO17_SEL_GPIO9                    (1 << 17)
#define GPR_GPR29_GPIO_MUX4_GPIO18_SEL_GPIO4                    (0 << 18)
#define GPR_GPR29_GPIO_MUX4_GPIO18_SEL_GPIO9                    (1 << 18)
#define GPR_GPR29_GPIO_MUX4_GPIO19_SEL_GPIO4                    (0 << 19)
#define GPR_GPR29_GPIO_MUX4_GPIO19_SEL_GPIO9                    (1 << 19)
#define GPR_GPR29_GPIO_MUX4_GPIO20_SEL_GPIO4                    (0 << 20)
#define GPR_GPR29_GPIO_MUX4_GPIO20_SEL_GPIO9                    (1 << 20)
#define GPR_GPR29_GPIO_MUX4_GPIO21_SEL_GPIO4                    (0 << 21)
#define GPR_GPR29_GPIO_MUX4_GPIO21_SEL_GPIO9                    (1 << 21)
#define GPR_GPR29_GPIO_MUX4_GPIO22_SEL_GPIO4                    (0 << 22)
#define GPR_GPR29_GPIO_MUX4_GPIO22_SEL_GPIO9                    (1 << 22)
#define GPR_GPR29_GPIO_MUX4_GPIO23_SEL_GPIO4                    (0 << 23)
#define GPR_GPR29_GPIO_MUX4_GPIO23_SEL_GPIO9                    (1 << 23)
#define GPR_GPR29_GPIO_MUX4_GPIO24_SEL_GPIO4                    (0 << 24)
#define GPR_GPR29_GPIO_MUX4_GPIO24_SEL_GPIO9                    (1 << 24)
#define GPR_GPR29_GPIO_MUX4_GPIO25_SEL_GPIO4                    (0 << 25)
#define GPR_GPR29_GPIO_MUX4_GPIO25_SEL_GPIO9                    (1 << 25)
#define GPR_GPR29_GPIO_MUX4_GPIO26_SEL_GPIO4                    (0 << 26)
#define GPR_GPR29_GPIO_MUX4_GPIO26_SEL_GPIO9                    (1 << 26)
#define GPR_GPR29_GPIO_MUX4_GPIO27_SEL_GPIO4                    (0 << 27)
#define GPR_GPR29_GPIO_MUX4_GPIO27_SEL_GPIO9                    (1 << 27)
#define GPR_GPR29_GPIO_MUX4_GPIO28_SEL_GPIO4                    (0 << 28)
#define GPR_GPR29_GPIO_MUX4_GPIO28_SEL_GPIO9                    (1 << 28)
#define GPR_GPR29_GPIO_MUX4_GPIO29_SEL_GPIO4                    (0 << 29)
#define GPR_GPR29_GPIO_MUX4_GPIO29_SEL_GPIO9                    (1 << 29)
#define GPR_GPR29_GPIO_MUX4_GPIO30_SEL_GPIO4                    (0 << 30)
#define GPR_GPR29_GPIO_MUX4_GPIO30_SEL_GPIO9                    (1 << 30)
#define GPR_GPR29_GPIO_MUX4_GPIO31_SEL_GPIO4                    (0 << 31)
#define GPR_GPR29_GPIO_MUX4_GPIO31_SEL_GPIO9                    (1 << 31)

/* General Purpose Register 30 (GPR30) */

#define GPR_GPR30_FLEXSPI_REMAP_ADDR_START_SHIFT                (12)
#define GPR_GPR30_FLEXSPI_REMAP_ADDR_START_MASK                 (1 << GPR_GPR30_FLEXSPI_REMAP_ADDR_START_SHIFT)
#  define GPR_GPR30_FLEXSPI_REMAP_ADDR_START(n)                 ((uint32_t)(n) << GPR_GPR30_FLEXSPI_REMAP_ADDR_START_SHIFT)

/* General Purpose Register 31 (GPR31) */

#define GPR_GPR31_FLEXSPI_REMAP_ADDR_END_SHIFT                  (12)
#define GPR_GPR31_FLEXSPI_REMAP_ADDR_END_MASK                   (1 << GPR_GPR31_FLEXSPI_REMAP_ADDR_END_SHIFT)
#  define GPR_GPR31_FLEXSPI_REMAP_ADDR_END(n)                   ((uint32_t)(n) << GPR_GPR31_FLEXSPI_REMAP_ADDR_END_SHIFT)

/* General Purpose Register 32 (GPR32) */

#define GPR_GPR32_FLEXSPI_REMAP_ADDR_OFFSET_SHIFT                (12)
#define GPR_GPR32_FLEXSPI_REMAP_ADDR_OFFSET_MASK                 (1 << GPR_GPR32_FLEXSPI_REMAP_ADDR_OFFSET_SHIFT)
#  define GPR_GPR32_FLEXSPI_REMAP_ADDR_OFFSET(n)                 ((uint32_t)(n) << GPR_GPR32_FLEXSPI_REMAP_ADDR_OFFSET_SHIFT)

/* General Purpose Register 33 (GPR33) */

#define GPR_GPR33_OCRAM2_TZ_EN                                   (1 << 0)
#define GPR_GPR33_OCRAM2_TZ_ADDR_SHIFT                           (8)
#define GPR_GPR33_OCRAM2_TZ_ADDR_MASK                            (0x3f << GPR_GPR33_OCRAM2_TZ_ADDR_SHIFT)
#  define GPR_GPR33_OCRAM2_TZ_ADDR(n)                            ((uint32_t)(n) << GPR_GPR33_OCRAM2_TZ_ADDR_SHIFT)
#define GPR_GPR33_LOCK_OCRAM2_TZ_EN                              (1 << 16)
#define GPR_GPR33_LOCK_OCRAM2_TZ_ADDR_SHIFT                      (17)
#define GPR_GPR33_LOCK_OCRAM2_TZ_ADDR_MASK                       (0x3f << GPR_GPR33_LOCK_OCRAM2_TZ_ADDR_SHIFT)
#  define GPR_GPR33_LOCK_OCRAM2_TZ_ADDR(n)                       ((uint32_t)(n) << GPR_GPR33_LOCK_OCRAM2_TZ_ADDR_SHIFT)

/* General Purpose Register 34 (GPR34) */

#define GPR_GPR34_SIP_TEST_MUX_BOOT_PIN_SEL_SHIFT               (0)
#define GPR_GPR34_SIP_TEST_MUX_BOOT_PIN_SEL_MASK                (0xff << GPR_GPR34_SIP_TEST_MUX_BOOT_PIN_SEL_SHIFT)
#define GPR_GPR34_SIP_TEST_MUX_BOOT_PIN_SEL(n)                  ((uint32_t)(n) << GPR_GPR34_SIP_TEST_MUX_BOOT_PIN_SEL_SHIFT)
#define GPR_GPR34_SIP_TEST_MUX_QSPI_SIP_EN                      (1 << 8)

#endif /* __ARCH_ARM_SRC_IMXRT_HARDWARE_IMXRT106X_IOMUXC_H */
